codigo_fonte/LoadTests/Grupo de Atividade/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
Autenticação - Pagina Inicial,100,5399,4647,6310,"354,87","0,000%","14,25314","226,30","8,43","16258,0"
Autenticação - Post AD FS,100,906,83,1558,"379,03","0,000%","53,16321","466,25","134,96","8980,6"
Autenticação - Post Home PGD,100,73934,11844,78029,"11718,81","0,000%","1,26989","12,03","9,88","9697,0"
Autenticação - Seleção de Perfil,100,3396,21,65264,"11683,00","0,000%","1,49528","12,75","2,59","8731,0"
Open Grupo Atividade Page,200,20960,3298,36455,"7434,65","0,000%","1,78209","53,54","1,74","30765,5"
Post Grupo Atividade,200,22071,1983,47251,"11897,01","0,000%","1,81860","761,76","4,14","428923,0"
TOTAL,800,21212,21,78029,"23528,30","0,000%","3,85297","452,95","9,22","120380,5"